<!-- dflook/terraform-github-actions {"workspace":"modular-hackathon-jun-2025","backend_type":"remote","label":"Modular Hackathon Infrastructure","backend":"799aa1bb95774f8a9ff4d623b54d3dd605197995d906b17e2a1cc0fa5597d66c","plan_job_ref":"Job Terraform Plan #16 at https://github.com/albertocavalcante/hackathons/actions/runs/16689721948","plan_out_hash":"e9ae4691959bb8c2304cf2918d761c0f7954de2c717955755f3225964729b2fc","plan_hash":"ec5d2e0656dc1205c0eeb03be66a2526724b240cb0e1115185a026768dfd6ce1","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan for __Modular Hackathon Infrastructure__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # lambdalabs_instance.hackathon_gpu will be created
+   resource "lambdalabs_instance" "hackathon_gpu" {
+       file_system_names  = []
+       id                 = (known after apply)
+       instance_type_name = "gpu_1x_a10"
+       ip                 = (known after apply)
+       name               = "modular-hackathon-gpu-jun2025"
+       region_name        = "us-east-1"
+       ssh_key_names      = [
+           "hackathon-key",
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   available_instance_types = {
+       filter         = null
+       id             = "all"
+       instance_types = {
+           cpu_4x_general        = {
+               description          = "4x CPU General (16 GiB)"
+               gpu_description      = "N/A"
+               name                 = "cpu_4x_general"
+               price_cents_per_hour = 20
+               specs                = {
+                   gpus        = 0
+                   memory_gib  = 16
+                   storage_gib = 100
+                   vcpus       = 4
                }
            }
+           gpu_1x_a10            = {
+               description          = "1x A10 (24 GB PCIe)"
+               gpu_description      = "A10 (24 GB PCIe)"
+               name                 = "gpu_1x_a10"
+               price_cents_per_hour = 75
+               specs                = {
+                   gpus        = 1
+                   memory_gib  = 200
+                   storage_gib = 1400
+                   vcpus       = 30
                }
            }
+           gpu_1x_a100           = {
+               description          = "1x A100 (40 GB PCIe)"
+               gpu_description      = "A100 (40 GB PCIe)"
+               name                 = "gpu_1x_a100"
+               price_cents_per_hour = 129
+               specs                = {
+                   gpus        = 1
+                   memory_gib  = 200
+                   storage_gib = 512
+                   vcpus       = 30
                }
            }
+           gpu_1x_a100_sxm4      = {
+               description          = "1x A100 (40 GB SXM4)"
+               gpu_description      = "A100 (40 GB SXM4)"
+               name                 = "gpu_1x_a100_sxm4"
+               price_cents_per_hour = 129
+               specs                = {
+                   gpus        = 1
+                   memory_gib  = 200
+                   storage_gib = 512
+                   vcpus       = 30
                }
            }
+           gpu_1x_a6000          = {
+               description          = "1x A6000 (48 GB)"
+               gpu_description      = "A6000 (48 GB)"
+               name                 = "gpu_1x_a6000"
+               price_cents_per_hour = 80
+               specs                = {
+                   gpus        = 1
+                   memory_gib  = 100
+                   storage_gib = 200
+                   vcpus       = 14
                }
            }
+           gpu_1x_gh200          = {
+               description          = "1x GH200 (96 GB)"
+               gpu_description      = "GH200 (96 GB)"
+               name                 = "gpu_1x_gh200"
+               price_cents_per_hour = 149
+               specs                = {
+                   gpus        = 1
+                   memory_gib  = 432
+                   storage_gib = 4096
+                   vcpus       = 64
                }
            }
+           gpu_1x_h100_pcie      = {
+               description          = "1x H100 (80 GB PCIe)"
+               gpu_description      = "H100 (80 GB PCIe)"
+               name                 = "gpu_1x_h100_pcie"
+               price_cents_per_hour = 249
+               specs                = {
+                   gpus        = 1
+                   memory_gib  = 200
+                   storage_gib = 1024
+                   vcpus       = 26
                }
            }
+           gpu_1x_h100_sxm5      = {
+               description          = "1x H100 (80 GB SXM5)"
+               gpu_description      = "H100 (80 GB SXM5)"
+               name                 = "gpu_1x_h100_sxm5"
+               price_cents_per_hour = 329
+               specs                = {
+                   gpus        = 1
+                   memory_gib  = 225
+                   storage_gib = 2816
+                   vcpus       = 26
                }
            }
+           gpu_1x_rtx6000        = {
+               description          = "1x RTX 6000 (24 GB)"
+               gpu_description      = "RTX 6000 (24 GB)"
+               name                 = "gpu_1x_rtx6000"
+               price_cents_per_hour = 50
+               specs                = {
+                   gpus        = 1
+                   memory_gib  = 46
+                   storage_gib = 512
+                   vcpus       = 14
                }
            }
+           gpu_2x_a100           = {
+               description          = "2x A100 (40 GB PCIe)"
+               gpu_description      = "A100 (40 GB PCIe)"
+               name                 = "gpu_2x_a100"
+               price_cents_per_hour = 258
+               specs                = {
+                   gpus        = 2
+                   memory_gib  = 400
+                   storage_gib = 1024
+                   vcpus       = 60
                }
            }
+           gpu_2x_a6000          = {
+               description          = "2x A6000 (48 GB)"
+               gpu_description      = "A6000 (48 GB)"
+               name                 = "gpu_2x_a6000"
+               price_cents_per_hour = 160
+               specs                = {
+                   gpus        = 2
+                   memory_gib  = 200
+                   storage_gib = 1024
+                   vcpus       = 28
                }
            }
+           gpu_2x_h100_sxm5      = {
+               description          = "2x H100 (80 GB SXM5)"
+               gpu_description      = "H100 (80 GB SXM5)"
+               name                 = "gpu_2x_h100_sxm5"
+               price_cents_per_hour = 638
+               specs                = {
+                   gpus        = 2
+                   memory_gib  = 450
+                   storage_gib = 5632
+                   vcpus       = 52
                }
            }
+           gpu_4x_a100           = {
+               description          = "4x A100 (40 GB PCIe)"
+               gpu_description      = "A100 (40 GB PCIe)"
+               name                 = "gpu_4x_a100"
+               price_cents_per_hour = 516
+               specs                = {
+                   gpus        = 4
+                   memory_gib  = 800
+                   storage_gib = 1024
+                   vcpus       = 120
                }
            }
+           gpu_4x_a6000          = {
+               description          = "4x A6000 (48 GB)"
+               gpu_description      = "A6000 (48 GB)"
+               name                 = "gpu_4x_a6000"
+               price_cents_per_hour = 320
+               specs                = {
+                   gpus        = 4
+                   memory_gib  = 400
+                   storage_gib = 1024
+                   vcpus       = 56
                }
            }
+           gpu_4x_h100_sxm5      = {
+               description          = "4x H100 (80 GB SXM5)"
+               gpu_description      = "H100 (80 GB SXM5)"
+               name                 = "gpu_4x_h100_sxm5"
+               price_cents_per_hour = 1236
+               specs                = {
+                   gpus        = 4
+                   memory_gib  = 900
+                   storage_gib = 11264
+                   vcpus       = 104
                }
            }
+           gpu_8x_a100           = {
+               description          = "8x A100 (40 GB SXM4)"
+               gpu_description      = "A100 (40 GB SXM4)"
+               name                 = "gpu_8x_a100"
+               price_cents_per_hour = 1032
+               specs                = {
+                   gpus        = 8
+                   memory_gib  = 1800
+                   storage_gib = 6144
+                   vcpus       = 124
                }
            }
+           gpu_8x_a100_80gb_sxm4 = {
+               description          = "8x A100 (80 GB SXM4)"
+               gpu_description      = "A100 (80 GB SXM4)"
+               name                 = "gpu_8x_a100_80gb_sxm4"
+               price_cents_per_hour = 1432
+               specs                = {
+                   gpus        = 8
+                   memory_gib  = 1800
+                   storage_gib = 20480
+                   vcpus       = 240
                }
            }
+           gpu_8x_h100_sxm5      = {
+               description          = "8x H100 (80 GB SXM5)"
+               gpu_description      = "H100 (80 GB SXM5)"
+               name                 = "gpu_8x_h100_sxm5"
+               price_cents_per_hour = 2392
+               specs                = {
+                   gpus        = 8
+                   memory_gib  = 1800
+                   storage_gib = 22528
+                   vcpus       = 208
                }
            }
+           gpu_8x_v100           = {
+               description          = "8x Tesla V100 (16 GB)"
+               gpu_description      = "Tesla V100 (16 GB)"
+               name                 = "gpu_8x_v100"
+               price_cents_per_hour = 440
+               specs                = {
+                   gpus        = 8
+                   memory_gib  = 448
+                   storage_gib = 6041
+                   vcpus       = 92
                }
            }
        }
    }
+   hourly_cost              = "$0.75/hour"
+   instance_id              = (known after apply)
+   instance_ip              = (known after apply)
+   instance_name            = "modular-hackathon-gpu-jun2025"
+   instance_status          = "Instance provisioned successfully! Use 'make ssh' to connect."
+   instance_type            = "gpu_1x_a10"
+   jupyter_url              = (known after apply)
+   project_tags             = {
+       Environment = "development"
+       ManagedBy   = "terraform"
+       Owner       = "hackathon-team"
+       Project     = "modular-hackathon-jun-2025"
    }
+   region                   = "us-east-1"
+   setup_commands           = <<-EOT
        # After connecting via SSH, run these commands:
        
        # Install Modular Platform
        pip install modular --index-url https://dl.modular.com/public/nightly/python/simple/
        
        # Install additional ML frameworks
        pip install openai-whisper tinygrad
        
        # Create workspace
        mkdir -p ~/hackathon && cd ~/hackathon
        
        # Clone your hackathon repositories (replace with actual repos)
        # git clone <your-hackathon-repo>
        
        # Start MAX server for inference
        # max serve --model-path=modularai/Llama-3.1-8B-Instruct-GGUF
    EOT
+   ssh_command              = (known after apply)
+   ssh_key_used             = "*************"
+   startup_script           = <<-EOT
        #!/bin/bash
        # Install additional dependencies for hackathon
        sudo apt-get update
        
        # Install Modular if not present
        pip install modular --index-url https://dl.modular.com/public/nightly/python/simple/ --extra-index-url https://download.pytorch.org/whl/cpu
        
        # Install additional Python packages
        pip install whisper-openai
        pip install tinygrad
        
        # Set up workspace directory
        mkdir -p /home/ubuntu/hackathon
        cd /home/ubuntu/hackathon
        
        echo "GPU instance ready for Modular hackathon development!"
        echo "Instance type: gpu_1x_a10"
        echo "Cost: $0.75/hour"
        echo "Remember to stop the instance when not in use!"
    EOT
```
</details>

:memo: Plan generated in [Terraform Plan #16](https://github.com/albertocavalcante/hackathons/actions/runs/16689721948)